# =============================================================================
# 1. Өгөгдсөн утга нь палиндром эсэхийг шалгах функц бич.
# 2. Өгөгдсөн жагсаалтаас том болон жижиг үсгүүдийг тоолох функц бич.
# 3. Жагсаалтын утгуудын үржвэрийг олох функц бич.
# 4. Өгөгдсөн тооны бактерал олох функц бич.
# 5. Өгөгдсөн жагсаалтыг урвуу болгох функц бич.
# 6. Жагсаалтын утгуудын нийлбэрийг олох функц бич.
# 7. Жагсаалтын давхардсан утгуудыг арилгах функц бич.
# 8. 3 тооны хамгийн ихийг олдог функц бич.
# =============================================================================
# =============================================================================
# #1
# def isPalindrome(a):
#     return a == a[::-1]
#  
#  
# # Driver code
# a = (input())
# b = isPalindrome(a)
#  
# if b:
#     print("Yes")
# else:
#     print("No")
# =============================================================================
#2
def count(a):
    a=''.join(a)
    upper=0
    lower=0
    for i in range(len(a)):
        if(a[i]>='a' and a[i]<='z'):
             lower+=1
        elif(a[i]>='A' and a[i]<='Z'):
             upper+=1
    print('Жижгээр бичигдсэн=' ,lower)
    print('Томоор бичигдсэн=' ,upper)
A=['aav','eej','ah']
count(A)
# #2
# a=input("Үг оруулах: ")
# upper=0
# lower=0
# for i in range(len(a)):
#       if(a[i]>='a' and a[i]<='z'):
#           lower+=1
#       #to upper case letter
#       elif(a[i]>='A' and a[i]<='Z'):
#           upper+=1
# print('Жижгээр бичигдсэн=' ,lower)
# print('Томоор бичигдсэн=' ,upper)
# =============================================================================
# #3
# def urjver(a):
#      x=1
#      k=0
#      while len(a)>k:
#          x=x*a[k]
#          k+=1
#      return x
# A=[1,2,3,4,5,6]
# print(urjver(A))
# =============================================================================
# =============================================================================
# #4
# def factorial(number):
#     if number < 0:
#         return('Эерэг утга оруулна уу!')
#     elif number == 0:
#         return('1')
#     else:
#         a=1
#         for i in range(1, number+1):
#             a = a * i
#         return(a)
# print(factorial(2))
# =============================================================================
# =============================================================================
# #5
# def urvuu(a):
#     a.reverse()
#     return a
# A=[1,2,3]
# print(urvuu(A))
# =============================================================================
# =============================================================================
# #6
# def niilber(a):
#      x=0
#      k=0
#      while len(a)>k:
#          x=x+a[k]
#          k+=1
#      return x
# A=[1,2,3,4,5,6]
# print(niilber(A))
# =============================================================================
# =============================================================================
# #7
# def davhardal(c):
#     d=list(set(c))
#     return d
# a=[1,1,2,2,3,4]
# print(davhardal(a))
# =============================================================================
# =============================================================================
#  #8
# def ih(x, y, z):
#     if x<z>y:
#         return z
#     elif x<y>z:
#         return y
#     else:
#         return x
# print(ih(5,5,3))
# =============================================================================
   
        
        
        
        
        
        
        
        
        
        
        
        
        
        